package main

import "fmt"

/*
คำนวนคะแนนสอบของนักเรียน โดยมีคะแนนเต็ม 100 คะแนน ต้องการทราบว่านักเรียนสอบผ่านหรือไม่ โดยใช้เกณฑ์ดังนี้
- คะแนนตั้งแต่ 50 คะแนนขึ้นไป => สอบผ่าน
- คะแนนน้อยกว่า 50 คะแนน => สอบไม่ผ่าน
*/

func main() {
	//รับ Input
	// 100 => >=50 สอบผ่าน ,  สอบไม่ผ่าน
	var score int

	fmt.Println("ป้อนคะแนนนักเรียน = ")
	fmt.Scanf("%d", &score)
	fmt.Println("คะแนนสอบ = ", score)

	//ประมวลผลคะแนน
	if score >= 50 {
		fmt.Println("สอบผ่าน")
	} else {
		fmt.Println("สอบไม่ผ่าน")
	}

}
